content = [
    "1. Перечень планируемых результатов обучения по дисциплинe (модулю), соотнесенных с планируемыми результатами "
    "освоения ОПОП ВО",
    "2. Место дисциплины (модуля) в структуре ОПОП ВО",
    "3. Объем дисциплины (модуля) в зачетных единицах с указанием количества часов, выделенных на контактную работу "
    "обучающихся с преподавателем (по видам учебных занятий) и на самостоятельную работу обучающихся",
    "4. Содержание дисциплины (модуля), структурированное по темам (разделам) с указанием отведенного на них "
    "количества академических часов и видов учебных занятий",
    "4.1. Структура и тематический план контактной и самостоятельной работы по дисциплинe (модулю)",
    "4.2. Содержание дисциплины (модуля)",
    "5. Перечень учебно-методического обеспечения для самостоятельной работы обучающихся по дисциплинe (модулю)",
    "6. Фонд оценочных средств по дисциплинe (модулю)",
    "7. Перечень литературы, необходимой для освоения дисциплины (модуля)",
    '8. Перечень ресурсов информационно-телекоммуникационной сети "Интернет", необходимых для освоения дисциплины '
    "(модуля)",
    "9. Методические указания для обучающихся по освоению дисциплины (модуля)",
    "10. Перечень информационных технологий, используемых при осуществлении образовательного процесса по дисциплинe "
    "(модулю), включая перечень программного обеспечения и информационных справочных систем",
    "11. Описание материально-технической базы, необходимой для осуществления образовательного процесса по "
    "дисциплинe (модулю)",
    "12. Средства адаптации преподавания дисциплины (модуля) к потребностям обучающихся инвалидов и лиц с "
    "ограниченными возможностями здоровья",
    "13. Приложение №1. Фонд оценочных средств",
    "14. Приложение №2. Перечень литературы, необходимой для освоения дисциплины (модуля)",
    "15. Приложение №3. Перечень информационных технологий, используемых для освоения дисциплины (модуля), включая "
    "перечень программного обеспечения и информационных справочных систем",
]

support_paragraph1 = (
    "Самостоятельная работа обучающихся выполняется по заданию и при методическом "
    "руководстве преподавателя, но без его непосредственного участия. Самостоятельная "
    "работа подразделяется на самостоятельную работу на аудиторных занятиях и на "
    "внеаудиторную самостоятельную работу. Самостоятельная работа обучающихся "
    "включает как полностью самостоятельное освоение отдельных тем (разделов) "
    "дисциплины (модуля), так и проработку тем (разделов), осваиваемых во время "
    "аудиторной работы. Во время самостоятельной работы обучающиеся читают и "
    "конспектируют учебную, научную и справочную литературу, выполняют задания, "
    "направленные на закрепление знаний и отработку умений и навыков, готовятся к "
    "текущему и промежуточному контролю по дисциплине (модулю)."
)

support_paragraph2 = (
    "Организация самостоятельной работы обучающихся регламентируется "
    "нормативными документами, учебно-методической литературой и "
    "электронными образовательными ресурсами, включая: Порядок организации и "
    "осуществления образовательной деятельности по образовательным программам "
    "высшего образования - программам бакалавриата, программам специалитета, "
    "программам магистратуры (утвержден приказом Министерства образования "
    "и науки Российской Федерации от 5 апреля 2017 года №301) Письмо "
    "Министерства образования Российской Федерации №14-55-996ин/15 от 27 "
    'ноября 2002 г. "Об активизации самостоятельной работы студентов высших '
    'учебных заведений" Устав федерального государственного автономного '
    'образовательного учреждения "Казанский (Приволжский) федеральный университет" '
    "Правила внутреннего распорядка федерального государственного автономного "
    "образовательного учреждения высшего профессионального образования "
    '"Казанский (Приволжский) федеральный университет" Локальные нормативные '
    "акты Казанского (Приволжского) федерального университета."
)

valuation_fund = [
    "Фонд оценочных средств по дисциплине (модулю) включает оценочные материалы, направленные на проверку освоения "
    "компетенций, в том числе знаний, умений и навыков. Фонд оценочных средств включает оценочные средства текущего "
    "контроля и оценочные средства промежуточной аттестации.",
    "фонде оценочных средств содержится следующая информация:",
    "-соответствие компетенций планируемым результатам обучения по дисциплине (модулю);",
    "–критерии оценивания сформированности компетенций;",
    "–механизм формирования оценки по дисциплине (модулю);",
    "–описание порядка применения и процедуры оценивания для каждого оценочного средства;",
    "–критерии оценивания для каждого оценочного средства;",
    "–содержание оценочных средств, включая требования, предъявляемые к действиям обучающихся, демонстрируемым "
    "результатам, задания различных типов.",
    "Фонд оценочных средств по дисциплине находится в Приложении 1 к программе дисциплины (модулю).",
]

literature = [
    "Освоение дисциплины (модуля) предполагает изучение основной и дополнительной учебной литературы. Литература "
    "может быть доступна обучающимся в одном из двух вариантов (либо в обоих из них):",
    "–в электронном виде – через электронные библиотечные системы на основании заключенных КФУ договоров "
    "с правообладателями;",
    "–в печатном виде – в Научной библиотеке им. Н.И. Лобачевского. Обучающиеся получают учебную литературу на "
    "абонементе по читательским билетам в соответствии с правилами пользования Научной библиотекой.",
    "Электронные издания доступны дистанционно из любой точки при введении обучающимся своего логина и пароля от "
    "личного кабинета в системе «Электронный университет». При использовании печатных изданий библиотечный фонд "
    "должен быть укомплектован ими из расчета не менее 0,5 экземпляра каждого из изданий основной литературы и не "
    "менее 0,25 экземпляра дополнительной литературы на каждого обучающегося из числа лиц, одновременно осваивающих "
    "данную дисциплину (модуль).",
    "Перечень литературы, необходимой для освоения дисциплины (модуля), находится в Приложении 2 к рабочей программе "
    "дисциплины (модуля). Он подлежит обновлению при изменении условий договоров КФУ с правообладателями электронных "
    "изданий и при изменении комплектования фондов Научной библиотеки КФУ.",
]

section10 = (
    "Перечень информационных технологий, используемых при осуществлении образовательного процесса по "
    "дисциплине (модулю), включая перечень программного обеспечения и информационных справочных систем "
    "представлен в Приложении 3 к рабочей программе дисциплины (модуля)."
)

section11 = (
    "Материально-техническое обеспечение образовательного процесса по дисциплине (модулю) включает в себя "
    "следующие компоненты: Помещения для самостоятельной работы обучающихся, укомплектованные "
    "специализированной мебелью (столы и стулья) и оснащенные компьютерной техникой с возможностью "
    'подключения к сети "Интернет" и обеспечением доступа в электронную информационно-образовательную '
    "среду КФУ. Учебные аудитории для контактной работы с преподавателем, укомплектованные специализированной"
    " мебелью (столы и стулья). Компьютер и принтер для распечатки раздаточных материалов. "
    "Мультимедийная аудитория. Компьютерный класс."
)

section12 = [
    "При необходимости в образовательном процессе применяются следующие методы и технологии, облегчающие восприятие "
    "информации обучающимися инвалидами и лицами с ограниченными возможностями здоровья:",
    "- создание текстовой версии любого нетекстового контента для его возможного преобразования в альтернативные "
    "формы, удобные для различных пользователей;",
    "- создание контента, который можно представить в различных видах без потери данных или структуры, предусмотреть "
    "возможность масштабирования текста и изображений без потери качества, предусмотреть доступность управления "
    "контентом с клавиатуры;",
    "- создание возможностей для обучающихся воспринимать одну и ту же информацию из разных источников - например, "
    "так, чтобы лица с нарушениями слуха получали информацию визуально, с нарушениями зрения - аудиально;",
    "- применение программных средств, обеспечивающих возможность освоения навыков и умений, формируемых дисциплиной "
    "(модулем), за счёт альтернативных способов, в том числе виртуальных лабораторий и симуляционных технологий;",
    "- применение дистанционных образовательных технологий для передачи информации, организации различных форм "
    "интерактивной контактной работы обучающегося с преподавателем, в том числе вебинаров, которые могут быть "
    "использованы для проведения виртуальных лекций с возможностью взаимодействия всех участников дистанционного "
    "обучения, проведения семинаров, выступления с докладами и защиты выполненных работ, проведения тренингов, "
    "организации коллективной работы;",
    "- применение дистанционных образовательных технологий для организации форм текущего и промежуточного контроля;",
    "- увеличение продолжительности сдачи обучающимся инвалидом или лицом с ограниченными возможностями здоровья форм "
    "промежуточной аттестации по отношению к установленной продолжительности их сдачи:",
    "- продолжительности сдачи зачёта или экзамена, проводимого в письменной форме, - не более чем на 90 минут;",
    "- продолжительности подготовки обучающегося к ответу на зачёте или экзамене, проводимом в устной форме, - "
    "не более чем на 20 минут;",
    "- продолжительности выступления обучающегося при защите курсовой работы - не более чем на 15 минут.",
]


constants = {
    "content": content,
    "support_paragraph1": support_paragraph1,
    "support_paragraph2": support_paragraph2,
    "valuation_fund": valuation_fund,
    "literature": literature,
    "section10": section10,
    "section11": section11,
    "section12": section12,
}
